[
    {
    "role": "Ingeniero en Sistemas Inteligentes",
    "organisation": "AR Management Partners S.A.",
    "startDate": "Noviembre, 2025",
    "endDate": "Actualidad",
    "experiences": [
      "Desarrollo de scripts utilizando Selenium y PyAutoGUI para automatizar procesos web de la empresa.",
      "Desarrollo de aplicaciones de escritorio para la automatización de reportes.",
      "Administración, migración y reportería de bases de datos Excel y Microsoft SQL Server.",
      "Comunicación técnica en inglés para la coordinación de tareas con los gerentes.",
      "Comunicación efectiva para el levantamiento de requerimientos de automatizaciones y futuros desarrollos que aumenten la productividad en los departamentos asignados.",
      "Presentación y documentación de cada proyecto.",
      "Asistencia en el área de soporte de TI."
    ],
    "imageSrc": "history/armpsa.avif"
  },
  {
    "role": "Software Developer",
    "organisation": "Trescloud",
    "startDate": "Abril, 2025",
    "endDate": "Octubre, 2025",
    "experiences": [
      "Conocimiento de los módulos CRM, Inventario, Compras, HelpDesk y configuraciones de Odoo ERP & CRM, funcional y developer.",
      "Creación de guías, documentación y levantamiento de requerimientos.",
      "Entorno de desarrollo en Ubuntu con Python environments, JavaScript y PostgreSQL.",
      "Versionamiento y trabajo en equipo gestionado en GitHub.",
      "Dominio del Inglés para capacitaciones y cursos internos.",
      "Dailys, Weeklys y reuniones internas para dar seguimiento a las tareas diarias, coordinar actividades de la semana y solventar dudas.",
      "Manejo de Google Suite para las tareas del día a día y comunicación con el equipo.",
      "DeskTime control de horas y monitoreo del trabajo remoto."
    ],
    "imageSrc": "history/trescloud.jpg"
  },
  {
    "role": "Ingeniero de Software",
    "organisation": "Holcim",
    "startDate": "Septiembre, 2024",
    "endDate": "Abril, 2025",
    "experiences": [
      "Migración de reportes con DevExpress para WF",
      "Mejora UX/UI",
      "Manejo de SQL Server y programación en .NET C#",
      "Metodología Kanvan.",
      "Uso de JIRA para gestionar tareas y flujos de trabajo.",
      "Auditoría y manejo de logs en .NET para mejorar la depuración de errores.",
      "Refactorización de código en .NET C# para mejorar rendimiento y mantenibilidad.",
      "Automatización de cálculos y distribución de costos en base a reglas contables específicas.",
      "Validaciones y controles para evitar errores en la asignación de costos.",
      "Pruebas y debugging intensivo para asegurar la precisión de los montos redistribuidos."
    ],
    "imageSrc": "history/holcim.jpg"
  },
  {
    "role": "Gestor de contenido WordPress",
    "organisation": "Fundación Más Que Vencedores",
    "startDate": "Enero, 2024",
    "endDate": "Abril, 2024",
    "experiences": [
      "Instalar WordPress desde el panel de Hostinger.",
      "Configurar el dominio y SSL para la seguridad del sitio.",
      "Realizar un análisis de los requerimientos del cliente o proyecto.",
      "Seleccionar y justificar la elección del tema y plugins a utilizar.",
      "Monitorear el tiempo de actividad y el rendimiento del servidor en Hostinger.",
      "Configurar menús, widgets y barras laterales."
    ],
    "imageSrc": "history/fundacionmqvencedores.jpg"
  },
  {
    "role": "Desarrollador de Software",
    "organisation": "Autónomo",
    "startDate": "Enero, 2024",
    "endDate": "Febrero, 2024",
    "experiences": [
      "Diseño y Desarrollo de la Interfaz de inventario en JavaFX",
      "Implementar CRUD para productos y clientes.",
      "Leer y escribir datos en archivos JSON para persistencia de datos.",
      "Implementar validaciones para garantizar la integridad de los datos.",
      "Manejo de excepciones para evitar fallos inesperados.",
      "Probar la persistencia y recuperación de datos en archivos JSON.",
      "Versionamiento utilizando Git y manejo del repositorio con GitHub."
    ],
    "imageSrc": "history/javafx.png"
  },
  {
    "role": "Profesor de Robótica",
    "organisation": "Unidad Educativa Salesiana Cristobal Colón",
    "startDate": "2019",
    "endDate": "2021",
    "experiences": [
      "Dos años organizando y dirigiendo clases de Robótica en el AES – MJS en la Unidad Educativa Particular Bilingüe Salesiana Cristóbal Colón, presentando temas como terminología básica – intermedia de electrónica y robótica, guía hasta la programación funcional en lenguaje C dedicada a Arduino, implementación de sensores y automatización de actuadores en Arduino.",
      "Explicación teórica sobre Arduino y el lenguaje C.",
      "Realización de ejercicios básicos de programación en C con Arduino.",
      "Conexión y prueba de sensores con Arduino.",
      "Control de motores y actuadores en proyectos prácticos como manos robóticas, maquetas con temática tecnológica.",
      "Gestión de proyectos de robótica.",
      "Presentación y análisis de los proyectos realizados.",
      "Evaluación y retroalimentación sobre los conocimientos adquiridos.",
      "Entrega de un manual o guía para consulta futura."
    ],
    "imageSrc": "history/arduino.webp"
  }
]
